In [47]:
import pandas as pd
import numpy as np
directory=r"C:\Users\ashwi\Desktop\Ashwin\pydata-book\examples"

In [49]:
df = pd.read_csv(directory+'\ex1.csv')

In [51]:
pd.read_table(r'C:\Users\ashwi\Desktop\Ashwin\pydata-book\examples\ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [52]:
pd.read_csv(directory+'\ex2.csv',header=None,names=['a','b','c','d','Message'])

   a   b   c   d Message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [53]:
pd.read_csv(directory+'\ex2.csv',header=None,names=['a','b','c','d','Message'],index_col='Message')

         a   b   c   d
Message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [57]:
parsed = pd.read_csv(directory+'\csv_mindex.csv',index_col=['key1','key2'])

In [58]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [59]:
parsed.loc[['one','a'],'value1':'value2']

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8

In [66]:
pd.read_table(directory+'\ex3.csv',sep='\s+')

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [68]:
pd.read_csv(directory+'\ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [70]:
pd.read_csv(directory+'\ex5.csv',na_values=['NULL'])

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [92]:
pd.options.display.max_rows = 10

In [97]:
result = pd.read_csv(directory+'/ex6.csv',nrows = 5)

In [98]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [99]:
pd.read_csv(directory+'/ex6.csv')

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [121]:
chunker = pd.read_csv(directory+'/ex6.csv',chunksize=100)

In [124]:
tot = pd.Series([])
for piece in chunker:
    print(piece['key'].value_counts())
    tot = tot.add(piece['key'], fill_value=0)

tot = tot.sort_values(ascending=False)

In [125]:
tot

Series([], dtype: float64)

In [126]:
data = pd.read_csv(directory+'/ex5.csv')

In [127]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [131]:
import sys

In [132]:
data.to_csv(sys.stdout,sep = "|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [133]:
import csv
f = open(directory+'/ex7.csv')

In [135]:
reader = csv.reader(f)

In [138]:
for f in reader:
    print(f)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [139]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [149]:
obj

'\n{"name": "Wes",\n "places_lived": ["United States", "Spain", "Germany"],\n "pet": null,\n "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},\n              {"name": "Katie", "age": 38,\n               "pets": ["Sixes", "Stache", "Cisco"]}]\n}\n'

In [143]:
import json
result = json.loads(obj)

In [145]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [146]:
asjson = json.dumps(result)

In [165]:
result = pd.read_json(directory+'/example.json')

In [190]:
dic = {'a':[],'b':[],'c':[]}

In [191]:
with open(directory+'/example.json') as json_file:
    data = json.load(json_file)
    for i in data:
        dic['a'].append(i['a'])
        dic['b'].append(i['b'])
        dic['c'].append(i['c'])
df = pd.DataFrame(dic)        
df

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [192]:
df1 = pd.read_json(directory+'/example.json')

In [193]:
df1

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [196]:
df1.to_json()

'{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}'

In [200]:
from bs4 import BeautifulSoup
from urllib.request import urlopen
import requests

In [204]:
tables = pd.read_html(r'C:/Users/ashwi/Desktop/Ashwin/pydata-book/examples/fdic_failed_bank_list.html')

In [208]:
tables

[                             Bank Name             City  ST   CERT  \
 0                          Allied Bank         Mulberry  AR     91
 1         The Woodbury Banking Company         Woodbury  GA  11297
 2               First CornerStone Bank  King of Prussia  PA  35312
 3                   Trust Company Bank          Memphis  TN   9956
 4           North Milwaukee State Bank        Milwaukee  WI  20364
 ..                                 ...              ...  ..    ...
 542                 Superior Bank, FSB         Hinsdale  IL  32646
 543                Malta National Bank            Malta  OH   6629
 544    First Alliance Bank & Trust Co.       Manchester  NH  34264
 545  National State Bank of Metropolis       Metropolis  IL   3815
 546                   Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                           Today's Bank  September 23, 2016
 1                            United Bank     August 19, 2016
 2    First-Citizens Bank & Trust Company         May 6, 2016
 3             The Bank of Fayette County      April 29, 2016
 4    First-Citizens Bank & Trust Company      March 11, 2016
 ..                                   ...                 ...
 542                Superior Federal, FSB       July 27, 2001
 543                    North Valley Bank         May 3, 2001
 544  Southern New Hampshire Bank & Trust    February 2, 2001
 545              Banterra Bank of Marion   December 14, 2000
 546                   Bank of the Orient    October 13, 2000

           Updated Date
 0    November 17, 2016
 1    November 17, 2016
 2    September 6, 2016
 3    September 6, 2016
 4        June 16, 2016
 ..                 ...
 542    August 19, 2014
 543  November 18, 2002
 544  February 18, 2003
 545     March 17, 2005
 546     March 17, 2005

 [547 rows x 7 columns]]

In [209]:
frame = pd.read_csv(directory+'/ex1.csv')

In [210]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [211]:
frame.to_pickle(directory+'/frame_pickle')

In [212]:
frame = pd.DataFrame({'a': np.random.rand(100)})

In [213]:
frame

           a
0   0.161481
1   0.268856
2   0.879768
3   0.774317
4   0.589602
..       ...
95  0.777809
96  0.152356
97  0.512705
98  0.347060
99  0.096833

[100 rows x 1 columns]

In [214]:
tore = pd.HDFStore('mydata.h5')

In [215]:
tore

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [216]:
tore['obj1'] = frame
tore['obj1_col'] = frame['a']

In [217]:
tore

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [218]:
tore['obj1']

           a
0   0.161481
1   0.268856
2   0.879768
3   0.774317
4   0.589602
..       ...
95  0.777809
96  0.152356
97  0.512705
98  0.347060
99  0.096833

[100 rows x 1 columns]

In [222]:
pd.read_excel(directory+'/ex1.xlsx','Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [223]:
import sqlite3

In [224]:
query = "CREATE TABLE test(a VARCHAR(20),v VARCHAR(20),c REAL , d INTEGER);"

In [233]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),('Sacramento', 'California', 1.7, 5)]
query = "INSERT INTO TEST VALUES(?,?,?,?);"

In [237]:
con = sqlite3.connect('mydata.sqlite')
con.executemany(query,data)

In [238]:
cursor = con.execute("SELECT * FROM test")

In [239]:
row = cursor.fetchall()

In [240]:
row

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [242]:
cursor.description

(('a', None, None, None, None, None, None),
 ('v', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [244]:
pd.DataFrame(row,columns= [x[0] for x in cursor.description])

             a           v     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5